---
kind: property
id: P:Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.PointSelectionText
source: html/b4c28e55-d903-a7d4-0e99-ded1892d544c.htm
---
# Autodesk.Revit.DB.Structure.ConnectionInputPointInfo.PointSelectionText Property

A string used to select input point by some connections.

## Syntax (C#)
```csharp
public string PointSelectionText { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null